results/wrk2/graalvmee1/jsonget.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R120000 -L -v http://localhost:9000/json
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/json
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.365ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.309ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.330ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.309ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.37ms    1.40ms  28.59ms   92.70%
    Req/Sec    31.70k     3.63k   66.67k    78.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.06ms
 75.000%    1.64ms
 90.000%    2.45ms
 99.000%    7.73ms
 99.900%   14.77ms
 99.990%   19.79ms
 99.999%   26.86ms
100.000%   28.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.031     0.000000            3         1.00
       0.363     0.100000       602159         1.11
       0.543     0.200000      1198867         1.25
       0.714     0.300000      1801069         1.43
       0.884     0.400000      2399642         1.67
       1.058     0.500000      2996599         2.00
       1.151     0.550000      3298498         2.22
       1.251     0.600000      3596446         2.50
       1.363     0.650000      3896130         2.86
       1.492     0.700000      4196409         3.33
       1.644     0.750000      4494629         4.00
       1.733     0.775000      4645387         4.44
       1.833     0.800000      4795262         5.00
       1.947     0.825000      4944415         5.71
       2.083     0.850000      5095404         6.67
       2.247     0.875000      5244763         8.00
       2.343     0.887500      5319098         8.89
       2.453     0.900000      5393650        10.00
       2.583     0.912500      5469150        11.43
       2.739     0.925000      5543494        13.33
       2.943     0.937500      5618278        16.00
       3.075     0.943750      5655935        17.78
       3.237     0.950000      5693117        20.00
       3.451     0.956250      5730620        22.86
       3.745     0.962500      5767982        26.67
       4.179     0.968750      5805326        32.00
       4.463     0.971875      5824089        35.56
       4.803     0.975000      5842914        40.00
       5.203     0.978125      5861503        45.71
       5.687     0.981250      5880253        53.33
       6.263     0.984375      5898969        64.00
       6.603     0.985938      5908402        71.11
       6.979     0.987500      5917744        80.00
       7.419     0.989062      5927042        91.43
       7.943     0.990625      5936427       106.67
       8.543     0.992188      5945772       128.00
       8.887     0.992969      5950526       142.22
       9.271     0.993750      5955184       160.00
       9.719     0.994531      5959852       182.86
      10.239     0.995313      5964525       213.33
      10.823     0.996094      5969179       256.00
      11.159     0.996484      5971515       284.44
      11.535     0.996875      5973870       320.00
      11.967     0.997266      5976189       365.71
      12.455     0.997656      5978529       426.67
      12.999     0.998047      5980898       512.00
      13.311     0.998242      5982064       568.89
      13.655     0.998437      5983231       640.00
      13.991     0.998633      5984396       731.43
      14.391     0.998828      5985562       853.33
      14.815     0.999023      5986723      1024.00
      15.047     0.999121      5987323      1137.78
      15.295     0.999219      5987905      1280.00
      15.567     0.999316      5988485      1462.86
      15.871     0.999414      5989073      1706.67
      16.231     0.999512      5989648      2048.00
      16.447     0.999561      5989953      2275.56
      16.687     0.999609      5990242      2560.00
      16.943     0.999658      5990527      2925.71
      17.263     0.999707      5990833      3413.33
      17.615     0.999756      5991112      4096.00
      17.855     0.999780      5991262      4551.11
      18.095     0.999805      5991408      5120.00
      18.447     0.999829      5991553      5851.43
      18.831     0.999854      5991695      6826.67
      19.279     0.999878      5991844      8192.00
      19.551     0.999890      5991917      9102.22
      19.855     0.999902      5991988     10240.00
      20.191     0.999915      5992065     11702.86
      20.623     0.999927      5992135     13653.33
      21.087     0.999939      5992208     16384.00
      21.375     0.999945      5992244     18204.44
      21.711     0.999951      5992281     20480.00
      22.191     0.999957      5992316     23405.71
      22.895     0.999963      5992353     27306.67
      23.887     0.999969      5992390     32768.00
      24.127     0.999973      5992408     36408.89
      24.447     0.999976      5992426     40960.00
      25.055     0.999979      5992444     46811.43
      25.839     0.999982      5992463     54613.33
      26.399     0.999985      5992483     65536.00
      26.511     0.999986      5992490     72817.78
      26.655     0.999988      5992499     81920.00
      26.783     0.999989      5992508     93622.86
      26.991     0.999991      5992518    109226.67
      27.295     0.999992      5992527    131072.00
      27.343     0.999993      5992531    145635.56
      27.455     0.999994      5992536    163840.00
      27.663     0.999995      5992540    187245.71
      27.823     0.999995      5992545    218453.33
      27.903     0.999996      5992550    262144.00
      27.983     0.999997      5992554    291271.11
      27.983     0.999997      5992554    327680.00
      27.999     0.999997      5992556    374491.43
      28.031     0.999998      5992560    436906.67
      28.063     0.999998      5992561    524288.00
      28.079     0.999998      5992562    582542.22
      28.191     0.999998      5992563    655360.00
      28.223     0.999999      5992565    748982.86
      28.271     0.999999      5992566    873813.33
      28.287     0.999999      5992567   1048576.00
      28.287     0.999999      5992567   1165084.44
      28.367     0.999999      5992568   1310720.00
      28.367     0.999999      5992568   1497965.71
      28.463     0.999999      5992569   1747626.67
      28.479     1.000000      5992570   2097152.00
      28.479     1.000000      5992570   2330168.89
      28.479     1.000000      5992570   2621440.00
      28.479     1.000000      5992570   2995931.43
      28.543     1.000000      5992571   3495253.33
      28.543     1.000000      5992571   4194304.00
      28.543     1.000000      5992571   4660337.78
      28.543     1.000000      5992571   5242880.00
      28.543     1.000000      5992571   5991862.86
      28.607     1.000000      5992572   6990506.67
      28.607     1.000000      5992572          inf
#[Mean    =        1.370, StdDeviation   =        1.396]
#[Max     =       28.592, Total count    =      5992572]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7196372 requests in 1.00m, 2.63GB read
Requests/sec: 119942.88
Transfer/sec:     44.95MB