results/wrk2/graalvmee1/jsonpost.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R65000 -L -v -s src/test/lua/jsonPost.lua http://localhost:9000/json
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/json
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.801ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.643ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.637ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.563ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.60ms    2.14ms  52.42ms   95.11%
    Req/Sec    17.16k     1.79k   28.33k    79.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.16ms
 75.000%    1.71ms
 90.000%    2.52ms
 99.000%   10.94ms
 99.900%   30.05ms
 99.990%   38.81ms
 99.999%   48.35ms
100.000%   52.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.085     0.000000            1         1.00
       0.520     0.100000       324668         1.11
       0.695     0.200000       650752         1.25
       0.849     0.300000       974523         1.43
       1.001     0.400000      1300285         1.67
       1.161     0.500000      1623226         2.00
       1.248     0.550000      1785545         2.22
       1.342     0.600000      1949105         2.50
       1.445     0.650000      2109984         2.86
       1.566     0.700000      2273311         3.33
       1.711     0.750000      2434710         4.00
       1.798     0.775000      2516484         4.44
       1.896     0.800000      2597383         5.00
       2.009     0.825000      2678180         5.71
       2.141     0.850000      2759420         6.67
       2.303     0.875000      2840816         8.00
       2.401     0.887500      2880919         8.89
       2.521     0.900000      2921652        10.00
       2.669     0.912500      2962307        11.43
       2.865     0.925000      3002902        13.33
       3.153     0.937500      3043273        16.00
       3.371     0.943750      3063563        17.78
       3.683     0.950000      3083802        20.00
       4.143     0.956250      3104156        22.86
       4.739     0.962500      3124351        26.67
       5.495     0.968750      3144704        32.00
       5.931     0.971875      3154834        35.56
       6.419     0.975000      3164951        40.00
       6.999     0.978125      3175067        45.71
       7.683     0.981250      3185213        53.33
       8.567     0.984375      3195425        64.00
       9.095     0.985938      3200467        71.11
       9.719     0.987500      3205530        80.00
      10.463     0.989062      3210569        91.43
      11.287     0.990625      3215637       106.67
      12.351     0.992188      3220712       128.00
      12.975     0.992969      3223275       142.22
      13.655     0.993750      3225800       160.00
      14.455     0.994531      3228336       182.86
      15.295     0.995313      3230860       213.33
      16.263     0.996094      3233389       256.00
      16.911     0.996484      3234678       284.44
      17.743     0.996875      3235935       320.00
      18.975     0.997266      3237196       365.71
      21.007     0.997656      3238463       426.67
      23.391     0.998047      3239740       512.00
      24.527     0.998242      3240363       568.89
      25.519     0.998437      3241000       640.00
      26.511     0.998633      3241629       731.43
      28.079     0.998828      3242264       853.33
      30.271     0.999023      3242898      1024.00
      31.087     0.999121      3243218      1137.78
      31.727     0.999219      3243529      1280.00
      32.319     0.999316      3243851      1462.86
      32.991     0.999414      3244168      1706.67
      33.695     0.999512      3244495      2048.00
      34.015     0.999561      3244647      2275.56
      34.399     0.999609      3244802      2560.00
      34.943     0.999658      3244963      2925.71
      35.615     0.999707      3245115      3413.33
      36.383     0.999756      3245275      4096.00
      36.767     0.999780      3245351      4551.11
      37.183     0.999805      3245432      5120.00
      37.631     0.999829      3245510      5851.43
      38.047     0.999854      3245594      6826.67
      38.335     0.999878      3245668      8192.00
      38.591     0.999890      3245714      9102.22
      38.911     0.999902      3245749     10240.00
      39.743     0.999915      3245789     11702.86
      40.543     0.999927      3245827     13653.33
      41.279     0.999939      3245866     16384.00
      41.631     0.999945      3245886     18204.44
      41.919     0.999951      3245907     20480.00
      42.175     0.999957      3245927     23405.71
      42.559     0.999963      3245947     27306.67
      43.071     0.999969      3245965     32768.00
      43.519     0.999973      3245975     36408.89
      43.903     0.999976      3245986     40960.00
      44.383     0.999979      3245995     46811.43
      45.503     0.999982      3246005     54613.33
      46.815     0.999985      3246015     65536.00
      47.263     0.999986      3246020     72817.78
      47.583     0.999988      3246025     81920.00
      48.095     0.999989      3246030     93622.86
      48.671     0.999991      3246035    109226.67
      49.119     0.999992      3246040    131072.00
      49.343     0.999993      3246042    145635.56
      49.631     0.999994      3246045    163840.00
      49.983     0.999995      3246048    187245.71
      50.239     0.999995      3246050    218453.33
      50.591     0.999996      3246052    262144.00
      50.655     0.999997      3246054    291271.11
      50.719     0.999997      3246055    327680.00
      50.783     0.999997      3246056    374491.43
      50.847     0.999998      3246057    436906.67
      51.071     0.999998      3246058    524288.00
      51.103     0.999998      3246059    582542.22
      51.263     0.999998      3246060    655360.00
      51.263     0.999999      3246060    748982.86
      51.455     0.999999      3246061    873813.33
      51.455     0.999999      3246061   1048576.00
      51.775     0.999999      3246062   1165084.44
      51.775     0.999999      3246062   1310720.00
      51.775     0.999999      3246062   1497965.71
      52.127     0.999999      3246063   1747626.67
      52.127     1.000000      3246063   2097152.00
      52.127     1.000000      3246063   2330168.89
      52.127     1.000000      3246063   2621440.00
      52.127     1.000000      3246063   2995931.43
      52.447     1.000000      3246064   3495253.33
      52.447     1.000000      3246064          inf
#[Mean    =        1.604, StdDeviation   =        2.144]
#[Max     =       52.416, Total count    =      3246064]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3898059 requests in 1.00m, 1.43GB read
Requests/sec:  64968.76
Transfer/sec:     24.35MB